Autodesk.Revit.DB.SunAndShadowType
Sun study type enum of SunAndShadowSettings.
Since:
2011
Enum of sun study type.
Since:
2011

Autodesk.Revit.DB.SunAndShadowType.Lighting
Lighting study type (fixed sun position regardless of date and time).

Autodesk.Revit.DB.SunAndShadowType.MultiDayStudy
Multi day study type (range over date and time).

Autodesk.Revit.DB.SunAndShadowType.OneDayStudy
Single day study type (time range over a specific day).

Autodesk.Revit.DB.SunAndShadowType.StillImage
Still image study type (single point in time).